Autodesk.Revit.DB.Plumbing.PlumbingUtils.BreakCurve(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Breaks the pipe curve into two parts at the given position.
Remarks:
This method is not applicable for breaking the flex pipe.
document:
The document.
pipeId:
The element id of the pipe curve to break.
ptBreak:
The break point on the pipe curve.
Returns:
The new pipe curve element id if successful otherwise if a failure occurred an invalidElementId is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
"The element is neither a pipe nor a pipe placeholder."
-or-
"The given point is not on the pipe curve."
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PlumbingUtils.HasOpenConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.
document:
The document.
elemId:
Element id to check.
Returns:
True if given element has open piping connector, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Plumbing.PlumbingUtils.PlaceCapOnOpenEnds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Places caps on the open connectors of the pipe curve, pipe fitting or pipe accessory.
Remarks:
In order to place the cap, the cap type should be defined in the routing preferences that associates with the pipe type of the given element.
If the typeId is a valid element id, it will be used to override the pipe type that associates with the pipe type of the given element.
document:
The document.
elemId:
Element id of pipe curve, pipe fitting or pipe accessory.
typeId:
Pipe type element id.
Default is invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elemId does not exist in the document
-or-
The element elemId is neither an object of pipe curve, pipe fitting, nor pipe accessory.
-or-
The element elemId has no opened piping connector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2014

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects placeholders that looks like Cross connection.
Remarks:
The placeholders may or may not have physical connection. However
a) The ends of four connectors should intersect at same point;
b) the first and second placeholders should be collinear each other;
c) the third and fourth placeholders should be collinear each other and
d) the third and fourth should have intersection with first or second placeholder.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The first end connector of placeholder to be connected to the second.
connector2:
The second end connector of placeholder to be connected to the first.
connector3:
The third end connector of placeholder to be connected to the forth.
connector4:
The fourth end connector of placeholder to be connected to the third.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not pipe placeholder.
-or-
The owners of connectors belong to different types of system.
-or-
The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects placeholders that looks like Cross connection.
Remarks:
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The first element Id of pipe placeholder.
placeholder2Id:
The second element Id of pipe placeholder that intersects with first one.
placeholder3Id:
The third element Id of pipe placeholder that intersects with first one.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not pipe placeholder.
-or-
The element id placeholder2Id is not pipe placeholder.
-or-
The element id placeholder3Id is not pipe placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder2Id does not connect on the curve placeholder1Id or vice versa.
-or-
The curve placeholder3Id does not connect on the curve placeholder1Id or vice versa.
-or-
The curve placeholder2Id and placeholder3Id are not collinear.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects placeholders that looks like Cross connection.
Remarks:
The placeholders must intersect each other. If connection succeeds, a new
placeholder is created. If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The first element Id of pipe placeholder.
placeholder2Id:
The second element Id of pipe placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not pipe placeholder.
-or-
The element id placeholder2Id is not pipe placeholder.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtTee(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects three placeholders that looks like Tee connection.
Remarks:
The three placeholders may or may not have physically connections. However,
the first one should be collinear with the second and third one must have
intersection with first and second.
If first placeholder and second placeholder have the same size, the second one
is merged with first one and original placeholder element will be invalid.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The first end connector of placeholder to be connected to the second.
connector2:
The second end connector of placeholder to be connected to the first.
connector3:
The third end connector of placeholder to be connected to the first or second.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not pipe placeholder.
-or-
The owners of connectors belong to different types of system.
-or-
The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtTee(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects two placeholders that looks like Tee connection.
Remarks:
The second placeholder must have physically connection with the first one.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The first element Id of pipe placeholder.
placeholder2Id:
The second element Id of pipe placeholder which connects to first.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not pipe placeholder.
-or-
The element id placeholder2Id is not pipe placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder2Id does not connect on the curve placeholder1Id or vice versa.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtElbow(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects placeholders that looks like elbow connection.
Remarks:
The placeholders may have physical connection or may not connect at all.
In the latter case, the first one connects to the end of second one.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The first end connector of placeholder to be connected to.
connector2:
The second end connector of placeholder to be connected to.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not pipe placeholder.
-or-
The owners of connectors belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConnectPipePlaceholdersAtElbow(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects placeholders that looks like elbow connection.
Remarks:
There must be a physical end connection of placeholders.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The element Id of pipe placeholder.
placeholder2Id:
The element Id of pipe placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not pipe placeholder.
-or-
The element id placeholder2Id is not pipe placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder1Id and placeholder2Id are not physically connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils.ConvertPipePlaceholders(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Converts a collection of pipe placeholder elements into pipe elements.
Remarks:
Once conversion succeeds, the pipe placeholder elements are deleted.
The new pipe and fitting elements are created and connections are established.
document:
The document.
placeholderIds:
A collection of element IDs of pipe placeholders.
Returns:
A collection of element IDs of pipe and fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The given element ids (placeholderIds) are not pipe placeholders.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PlumbingUtils
General utility methods in the Autodesk Revit MEP product.
Since:
2012